# Arithmetic Operations in Pandas

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to show arithmetic operations in Pandas.
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [3]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int64
a    0
c    1
e    2
f    3
g    4
dtype: int64

In [4]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [5]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [6]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [7]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [8]:
df1.add(df2,fill_value=0) #Kate-B is nulo ya que nunca fue definida, en los dem√°s casos donde eran nulos pq no hab√≠a suma se ponen a cero

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [9]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [10]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [11]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [12]:
df2  #df2 es el mismo que el anterior

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [13]:
s=df2.iloc[1]   #Kate
s

A    3
C    4
D    5
Name: Kate, dtype: int64

In [14]:
df2-s #Se resta la fila de Kate a todas las filas

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [15]:
s2=df2["A"] #Se selecciona la columna A
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int64

In [16]:
df2.sub(s2,axis="index") #Se resta la columna A a todas las columnas

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

## Applying a Function

In [17]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"]) #Se crea un dataframe con valores aleatorios ( distribuci√≥n normal,media 0 y desviaci√≥n 1)
df

              A         B         C
Kim   -0.904983  0.947035 -0.953610
Susan  0.430311 -1.666062  1.610961
Tim   -0.309850 -0.629749 -0.480313
Tom    1.785558 -0.753637  1.426668

In [18]:
np.abs(df) #Se calcula el valor absoluto de cada elemento

              A         B         C
Kim    0.904983  0.947035  0.953610
Susan  0.430311  1.666062  1.610961
Tim    0.309850  0.629749  0.480313
Tom    1.785558  0.753637  1.426668

In [19]:
f=lambda x:x.max()-x.min() #Se define una funci√≥n que calcula la diferencia entre el m√°ximo y el m√≠nimo de un array

In [20]:
df.apply(f)        #Se aplica la funci√≥n a cada columna (con los valores iniciales)

A    2.690541
B    2.613097
C    2.564571
dtype: float64

In [21]:
df.apply(f,axis=1) #Se aplica la funci√≥n a cada fila

Kim      1.900645
Susan    3.277023
Tim      0.319900
Tom      2.539196
dtype: float64

In [22]:
def f(x):
    return x**2 #Se define una funci√≥n que eleva al cuadrado cada elemento

In [23]:
df.apply(f)

              A         B         C
Kim    0.818994  0.896876  0.909372
Susan  0.185167  2.775762  2.595196
Tim    0.096007  0.396584  0.230701
Tom    3.188219  0.567969  2.035383

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé